"use client";
import { FC } from "react";
import { useRouter } from "next/navigation";

import { publicRoutes } from "@/configs/routes.config";

import { Head } from "@/components/widgets/Head";
import { Container } from "@/components/ui/layouts/Container";
import { Button } from "@/components/ui/forms/buttons/Button";
import cls from './index.module.scss';


const Error404: FC = () => {
    const router = useRouter();
    const { push } = router;

    return (
        <section
            className={cls.error404Section}
        // initial="hidden"
        // whileInView="visible"
        // viewport={{ once: true, amount: 0.2 }}
        // variants={fadeIn}
        >
            <Container>
                <svg xmlns="http://www.w3.org/2000/svg" width="667" height="280" viewBox="0 0 667 280" fill="none">
                    <path d="M0.5 223.926V224.426H1H128.77V273.874V274.374H129.27H175.746H176.246V273.874V224.426H210.144H210.644V223.926V183.836V183.336H210.144H176.246V4.68038V4.18038H175.746H147.888H147.388H129.795H129.295H115.09H114.815L114.668 4.4132L0.577371 184.883L0.5 185.006V185.15V223.926ZM129.295 60.3861V183.336H51.3899V181.877L127.97 60.3861H129.295ZM277.033 262.976L277.036 262.978C292.624 273.999 311.284 279.5 332.991 279.5C354.698 279.5 373.314 274 388.815 262.978C404.399 251.959 416.314 236.014 424.57 215.173C432.915 194.243 437.078 169.028 437.078 139.54C437.078 110.227 432.915 85.1863 424.57 64.4314C416.313 43.6778 404.398 27.8203 388.814 16.8895C373.226 5.95669 354.611 0.5 332.991 0.5C311.372 0.5 292.756 5.95669 277.169 16.8895L277.168 16.8902C261.671 27.8211 249.757 43.6784 241.412 64.4314L241.412 64.4325C233.155 85.0992 228.992 110.139 228.904 139.538V139.54C228.904 168.94 233.024 194.111 241.28 215.04L241.281 215.042C249.625 235.882 261.538 251.87 277.033 262.976ZM372.341 212.762L372.341 212.763C362.7 229.198 349.59 237.359 332.991 237.359C321.909 237.359 312.357 233.722 304.312 226.447C296.26 219.078 289.996 208.128 285.549 193.55C281.192 178.979 279.05 160.98 279.137 139.542V139.541C279.225 107.505 284.123 83.2927 293.773 66.8426L293.774 66.8416C303.416 50.3178 316.482 42.1156 332.991 42.1156C343.983 42.1156 353.49 45.7937 361.537 53.1571L361.539 53.1591C369.591 60.4403 375.855 71.3035 380.302 85.7954C384.747 100.279 386.976 118.19 386.976 139.54C386.976 171.839 382.078 196.226 372.341 212.762ZM456.356 223.926V224.426H456.856H584.626V273.874V274.374H585.126H631.602H632.102V273.874V224.426H666H666.5V223.926V183.836V183.336H666H632.102V4.68038V4.18038H631.602H603.744H603.244H585.651H585.151H570.947H570.671L570.524 4.4132L456.434 184.883L456.356 185.006V185.15V223.926ZM583.826 60.3861H585.151V183.336H507.246V181.877L583.826 60.3861Z" stroke="url(#paint0_linear_80_5135)" />
                    <defs>
                        <linearGradient id="paint0_linear_80_5135" x1="-91.5" y1="102.5" x2="320.138" y2="529.371" gradientUnits="userSpaceOnUse">
                            <stop stopColor="#005306" stopOpacity="0" />
                            <stop offset="0.495" stopColor="#98BA96" />
                            <stop offset="1" stopColor="#064800" stopOpacity="0" />
                        </linearGradient>
                    </defs>
                </svg>
                <div className={cls.frame}>
                    <Head
                        center
                        title='Мы не нашли эту страницу!'
                        disc='Возможно вы ошиблись ссылкой. Перейдите на главную или найдите нужную вам страницу в футере.'
                    />
                    <Button
                        type='button'
                        title='Перейти на главную'
                        onClick={() => push(publicRoutes.home)}
                    >
                        Перейти на главную
                    </Button>
                </div>
            </Container>
        </section>
    );
}

export { Error404 };