export const cardsAbout = [
    {
        id: 1,
        title: 'Производительность',
        text: 'Производительность обеспечивается мощными процессорами AMD Ryzen 9 7950X3D с частотой 5,7 ГГц, которые гарантируют высокую мощность на одном потоке.',
    },
    {
        id: 2,
        title: 'Защита от DDoS',
        text: 'Наши серверы оснащены комплексной защитой от DDoS-атак, исключающей любые перебои и дающей вашим проектам необходимую стабильность.',
    },
    {
        id: 3,
        title: 'Стабильность',
        text: 'Наши серверы обеспечивают бескомпромиссную надежность, чтобы ваш проект функционировал на высоком уровне в любое время суток.',
    }
];