export const cardsAboutFreehost = [
    {
        id: 1,
        title: 'Удобство',
        text: 'Управляйте сервером через интуитивную панель без рекламы, с поддержкой до 1 Gbps и гибким SWAP. Всё для комфортной игры!',
    },
    {
        id: 2,
        title: 'Надёжность',
        text: 'Работаем 24/7 с игровым анти-DDoS и гибернацией. Вы получаете стабильное соединение и защиту в любое время суток.',
    },
    {
        id: 3,
        title: 'Оборудование',
        text: 'Серверы на выбор без компромиссов: минимальные технические ограничения и поддержка Bungee.',
    }
];
